W9D2/ArtShare/app/controllers/users_controller.rb

    def index
        users = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "andy"], ["email", "awyhoop@gmail.com"], ["created_at", "2019-07-22 23:19:17.020288"], ["updated_at", "2019-07-22 23:19:17.020288"]]

    def show
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "britney"], ["updated_at", "2019-07-23 20:23:02.481477"], ["id", 3]]